---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures
source: html/8840595e-9443-cb55-bfab-882395cb6aa8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures

Failures related to the GridChain sketch.

## Syntax (C#)
```csharp
public static class GridChainSketchFailures
```